# 081 별 표현식
# 다음과 같이 10개의 값이 저장된 scores 리스트가 있을 때, 
# start expression을 사용하여 좌측 8개의 값을 valid_score 변수에 바인딩하여라.
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# *valid_score, _, _= scores
# print(valid_score)

# 082
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# a,b,*valid_score = scores
# print(valid_score)

# 083
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# a,*valid_score,b = scores
# print(valid_score)

# 084 비어있는 딕셔너리
# temp = {}

# 085
# dic = {"메로나":1000, "폴라포":1200, "빵빠레":1800}
# print (dic)

# 086 딕셔너리 추가
# dic = {"메로나":1000, "폴라포":1200, "빵빠레":1800}
# dic["죠스바"] = 1200
# dic["월드콘"] = 1500
# print(dic)

# 087
# dic = {"메로나":1000, "폴라포":1200, "빵빠레":1800}
# dic["죠스바"] = 1200
# dic["월드콘"] = 1500
# print(dic["메로나"])

# 088
# dic = {"메로나":1000, "폴라포":1200, "빵빠레":1800}
# dic["죠스바"] = 1200
# dic["월드콘"] = 1500
# dic["메로나"] = 1300
# print(dic["메로나"])

# 089
ice = {'메로나': 1000,
       '폴로포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}
del ice["메로나"]
print(ice)



