# 181
# apart = [["101호","102호"],["201호","202호"],["301호","302호"]]

# 182
# stock = [["시가",100,200,300],["종가",80,210,330]

# 183
# stock = {"시가":[100,200,300],"종가":[80,210,330]} 

# 184
# stock = {"10/10":[100,200,300],"10/11":[80,210,330]}

# 185
# apart = [[101,102],[201,202],[301,302]]
# for i in apart:
#   for j in i:
#     print(str(j) + "호")

# 186
# apart = [[101,102],[201,202],[301,302]]
# for i in apart[::-1]:
#   for j in i:
#     print(str(j) + "호")

# 187
# apart = [[101,102],[201,202],[301,302]]
# for i in apart[::-1]:
#   for j in i[::-1]:
#     print(str(j) + "호")

# 188
# apart = [[101,102],[201,202],[301,302]]
# for i in apart:
#   for j in i:
#     print(str(j) + "호")
#     print("----------")

# 189
# apart = [[101,102],[201,202],[301,302]]
# for i in apart:
#   for j in i:
#     print(str(j) + "호")
#   print("-" * 5)

# 190
apart = [[101,102],[201,202],[301,302]]
for i in apart:
  for j in i:
    print(str(j) + "호")
print("-" * 5)